---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviserRuleId.op_Inequality(Autodesk.Revit.DB.PerformanceAdviserRuleId,Autodesk.Revit.DB.PerformanceAdviserRuleId)
source: html/d1d850aa-fd36-00e1-3cff-83fff4ae28b9.htm
---
# Autodesk.Revit.DB.PerformanceAdviserRuleId.op_Inequality Method

Compares two PerformanceAdviserRuleId instances.

## Syntax (C#)
```csharp
public static bool operator !=(
	PerformanceAdviserRuleId first,
	PerformanceAdviserRuleId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.PerformanceAdviserRuleId`) - The first PerformanceAdviserRuleId.
- **second** (`Autodesk.Revit.DB.PerformanceAdviserRuleId`) - The second PerformanceAdviserRuleId.

## Returns
True if the inputs are different, false if they are identical.